documents/images/graphio/stdlib/colorcorrect_color4_instance.dot
digraph {
  rankdir = LR;
    NG_colorcorrect_color4_N_combine_with_alpha [label= "combine4"];
    NG_colorcorrect_color4_N_combine_with_alpha[shape = box];
    NG_colorcorrect_color4_N_combine_with_alpha ->     NG_colorcorrect_color4_out;
    NG_colorcorrect_color4_out [label= "out"];
    NG_colorcorrect_color4_out[shape = box]; 
    NG_colorcorrect_color4_N_split_color [label= "separate3"];
    NG_colorcorrect_color4_N_split_color[shape = box];
    NG_colorcorrect_color4_N_split_color -> NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutr;
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutr [label= "outr."];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutr [label= "outr"];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutr [shape = ellipse];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutr ->     NG_colorcorrect_color4_N_combine_with_alpha [label= "in1"];
    NG_colorcorrect_color4_N_combine_with_alpha [label= "combine4"];
    NG_colorcorrect_color4_N_combine_with_alpha[shape = box]; 
    NG_colorcorrect_color4_N_colorcorrect [label= "colorcorrect"];
    NG_colorcorrect_color4_N_colorcorrect[shape = box];
    NG_colorcorrect_color4_N_colorcorrect ->     NG_colorcorrect_color4_N_split_color [label= "in"];
    NG_colorcorrect_color4_N_split_color [label= "separate3"];
    NG_colorcorrect_color4_N_split_color[shape = box]; 
    NG_colorcorrect_color4_hueINT [label="hue"];
    NG_colorcorrect_color4_hueINT [shape = ellipse];
    NG_colorcorrect_color4_N_colorcorrect [label="colorcorrect"];
    NG_colorcorrect_color4_hueINT -> NG_colorcorrect_color4_N_colorcorrect [label=".hue"];
    NG_colorcorrect_color4_saturationINT [label="saturation"];
    NG_colorcorrect_color4_saturationINT [shape = ellipse];
    NG_colorcorrect_color4_N_colorcorrect [label="colorcorrect"];
    NG_colorcorrect_color4_saturationINT -> NG_colorcorrect_color4_N_colorcorrect [label=".saturation"];
    NG_colorcorrect_color4_gammaINT [label="gamma"];
    NG_colorcorrect_color4_gammaINT [shape = ellipse];
    NG_colorcorrect_color4_N_colorcorrect [label="colorcorrect"];
    NG_colorcorrect_color4_gammaINT -> NG_colorcorrect_color4_N_colorcorrect [label=".gamma"];
    NG_colorcorrect_color4_liftINT [label="lift"];
    NG_colorcorrect_color4_liftINT [shape = ellipse];
    NG_colorcorrect_color4_N_colorcorrect [label="colorcorrect"];
    NG_colorcorrect_color4_liftINT -> NG_colorcorrect_color4_N_colorcorrect [label=".lift"];
    NG_colorcorrect_color4_gainINT [label="gain"];
    NG_colorcorrect_color4_gainINT [shape = ellipse];
    NG_colorcorrect_color4_N_colorcorrect [label="colorcorrect"];
    NG_colorcorrect_color4_gainINT -> NG_colorcorrect_color4_N_colorcorrect [label=".gain"];
    NG_colorcorrect_color4_contrastINT [label="contrast"];
    NG_colorcorrect_color4_contrastINT [shape = ellipse];
    NG_colorcorrect_color4_N_colorcorrect [label="colorcorrect"];
    NG_colorcorrect_color4_contrastINT -> NG_colorcorrect_color4_N_colorcorrect [label=".contrast"];
    NG_colorcorrect_color4_contrastpivotINT [label="contrastpivot"];
    NG_colorcorrect_color4_contrastpivotINT [shape = ellipse];
    NG_colorcorrect_color4_N_colorcorrect [label="colorcorrect"];
    NG_colorcorrect_color4_contrastpivotINT -> NG_colorcorrect_color4_N_colorcorrect [label=".contrastpivot"];
    NG_colorcorrect_color4_exposureINT [label="exposure"];
    NG_colorcorrect_color4_exposureINT [shape = ellipse];
    NG_colorcorrect_color4_N_colorcorrect [label="colorcorrect"];
    NG_colorcorrect_color4_exposureINT -> NG_colorcorrect_color4_N_colorcorrect [label=".exposure"];
    NG_colorcorrect_color4_N_combine_color [label= "combine3"];
    NG_colorcorrect_color4_N_combine_color[shape = box];
    NG_colorcorrect_color4_N_combine_color ->     NG_colorcorrect_color4_N_colorcorrect [label= "in"];
    NG_colorcorrect_color4_N_colorcorrect [label= "colorcorrect"];
    NG_colorcorrect_color4_N_colorcorrect[shape = box]; 
    NG_colorcorrect_color4_N_split_color4 [label= "separate4"];
    NG_colorcorrect_color4_N_split_color4[shape = box];
    NG_colorcorrect_color4_N_split_color4 -> NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outr;
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outr [label= "outr."];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outr [label= "outr"];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outr [shape = ellipse];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outr ->     NG_colorcorrect_color4_N_combine_color [label= "in1"];
    NG_colorcorrect_color4_N_combine_color [label= "combine3"];
    NG_colorcorrect_color4_N_combine_color[shape = box]; 
    NG_colorcorrect_color4_inINT [label="in"];
    NG_colorcorrect_color4_inINT [shape = ellipse];
    NG_colorcorrect_color4_N_split_color4 [label="separate4"];
    NG_colorcorrect_color4_inINT -> NG_colorcorrect_color4_N_split_color4 [label=".in"];
    NG_colorcorrect_color4_N_split_color4 [label= "separate4"];
    NG_colorcorrect_color4_N_split_color4[shape = box];
    NG_colorcorrect_color4_N_split_color4 -> NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outg;
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outg [label= "outg."];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outg [label= "outg"];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outg [shape = ellipse];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outg ->     NG_colorcorrect_color4_N_combine_color [label= "in2"];
    NG_colorcorrect_color4_N_combine_color [label= "combine3"];
    NG_colorcorrect_color4_N_combine_color[shape = box]; 
    NG_colorcorrect_color4_N_split_color4 [label= "separate4"];
    NG_colorcorrect_color4_N_split_color4[shape = box];
    NG_colorcorrect_color4_N_split_color4 -> NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outb;
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outb [label= "outb."];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outb [label= "outb"];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outb [shape = ellipse];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outb ->     NG_colorcorrect_color4_N_combine_color [label= "in3"];
    NG_colorcorrect_color4_N_combine_color [label= "combine3"];
    NG_colorcorrect_color4_N_combine_color[shape = box]; 
    NG_colorcorrect_color4_N_split_color [label= "separate3"];
    NG_colorcorrect_color4_N_split_color[shape = box];
    NG_colorcorrect_color4_N_split_color -> NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutg;
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutg [label= "outg."];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutg [label= "outg"];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutg [shape = ellipse];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutg ->     NG_colorcorrect_color4_N_combine_with_alpha [label= "in2"];
    NG_colorcorrect_color4_N_combine_with_alpha [label= "combine4"];
    NG_colorcorrect_color4_N_combine_with_alpha[shape = box]; 
    NG_colorcorrect_color4_N_split_color [label= "separate3"];
    NG_colorcorrect_color4_N_split_color[shape = box];
    NG_colorcorrect_color4_N_split_color -> NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutb;
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutb [label= "outb."];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutb [label= "outb"];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutb [shape = ellipse];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_coloroutb ->     NG_colorcorrect_color4_N_combine_with_alpha [label= "in3"];
    NG_colorcorrect_color4_N_combine_with_alpha [label= "combine4"];
    NG_colorcorrect_color4_N_combine_with_alpha[shape = box]; 
    NG_colorcorrect_color4_N_split_color4 [label= "separate4"];
    NG_colorcorrect_color4_N_split_color4[shape = box];
    NG_colorcorrect_color4_N_split_color4 -> NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outa;
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outa [label= "outa."];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outa [label= "outa"];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outa [shape = ellipse];
    NG_colorcorrect_color4_NG_colorcorrect_color4_N_split_color4outa ->     NG_colorcorrect_color4_N_combine_with_alpha [label= "in4"];
    NG_colorcorrect_color4_N_combine_with_alpha [label= "combine4"];
    NG_colorcorrect_color4_N_combine_with_alpha[shape = box]; 
}
